{
    "ua": {
        "link": "посилання",
        "homeLink": "ГОЛОВНА",
        "servicesLink": "ПОСЛУГИ",
        "aboutLink": "ПРО НАС",
        "contactsLink": "КОНТАКТИ",
        "projectsLink": "ПРОЕКТИ",
        "presentationText": "Розробка програмного забеспечення",
        "servicesTitle": "ПОСЛУГИ",
        "frontEndServiceTitle": "Розробка інтерфейсу користувача",
        "frontEndServiceInfo1": "Ви хочете мати сучасний, якісний та зручний інтерфейс? Для frontend розробки ми використовуємо сучасні фреймворки, такі як Angular та ReactJs.",
        "frontEndServiceInfo2": "Вам потрібен веб-сайт, а часу для розробки не багато? Модульна розробка інтерфейсу користувача за допомогою бібліотеки Angular material, допоможе реалізувати продукт в швидкі терміни.",
        "frontEndServiceInfo3": "Якщо ви хочете мати невеликий сайт-візитку, перечислених технологій буде достатньо, щоб задовольнити ваші потреби",
        "backEndServiceTitle": "Розробка серверної частини",
        "backEndServiceInfo1": "Якщо Вам потрібен великий сайт із бізнес логікою, наприклад інтернет магазин. Для backend розробки ми використовуємо сучасний фреймворк ASP.NET WEB API або ASP.NET MVC",
        "backEndServiceInfo2": "Бізнес логіка, дає можливість додавати нові дані, видаляти та оновлювати їх, що дасть Вашому веб додатоку більше можливостей.",
        "backEndServiceInfo3": "Якщо Вам потрібно реєструвати нових користувачів, та працювати з авторизованими людьми, то без серверної частини тут не обійтись.",
        "databaseServiceTitle": "Розробка баз данних",
        "databaseServiceInfo1": "Вам потрібно зберігати дані, які використовуються бізнес логікою вашого веб додатку? Для цього ми можемо розробити базу даних за допомогою технологій MSSQL Server або PostgreSQL",
        "databaseServiceInfo2": "Зазвичай бізнес логіка великих веб додатків використовуює базу даних для обробки інформації. Тому Вам слід звернути увагу на цю послугу.",
        "databaseServiceInfo3": "",
        "aboutTitle":"ПРО НАС",
        "about1":"Компанія була зареєстрована в 2020 році по спеціальності 'Комп'ютерне програмування'. Від початку свого існування ми займалися розробкою програмного забезпечення під замовлення.",
        "about2":"Основною спеціалізацією компанії є розробка веб додатків від найпростіших до найскладніших за масштабом та бізнес логікою. Одним із перших таких проектів була розробка серверної частити для веб сайту з дерматології, з використанням технологій ASP.NET Core 3 WEB API, Dapper та MSSQL Server. Мікросервісна архітектура допомогла зробити цей проект модульним та простим для модифікацій у майбутньому.",
        "about3":"Другий проект був для американської компанії, яка замалася зберіганням та доставками їжі. Дуже великий проект, де була робота не тільки на серверній частині, а й на стороні клієнта (браузер). Використовувались технології ASP.NET MVC 5, ASP.NET WEB API, Angular 5, Angular Material, Dapper та архітектура onion. Крім того, для підтримки автотестів ми використовували фреймворки Selenium і Atata.",
        "about4":"Темою наступного проекту була логістика для одягу від складів до магазинів. Цей веб додаток допомагає підвищити ефективність продажу товарів. Дуже цікавий проект із сучасними технологіями, версії яких постійно оновлювалися. Для розробки використовувались Angular, Angular Material, ASP.NET WEB API Core, ADO.NET, MSSQL Server, Entity Framework, SignalR та Azure Services.",
        "aboutCEO":"Директором компанії є Парасочка Микола Геннадійович. У 2016 році почав навчатись в Харківському політехнічному інституті за спеціальністю 'Комп'ютерна інженерія'. Отримав диплом бакалавра в 2020 році, а 23 грудня 2021 року отримав диплом магістра. Працює у сфері комп'ютерного програмування з 2019 року як .Net розробник повного стека.",
        "contactsTitle":"КОНТАКТИ",
        "CEO":"Директор: ",
        "CEOName": "Парасочка Микола Геннадійович",
        "CEOMobilePhoneNumber":"Моб. телефон: +380991191389",
        "firstName": "Ім'я",
        "lastName": "Прізвище",
        "email": "Email",
        "phoneNumber":"Моб. телефон",
        "messageTitle": "Повідомлення",
        "sendLabel": "Відправити",
        "onlyLetttersError": "Це поле може містити лише літери.",
        "textFieldMinLengthError": "Мінімальна довжина 2 літери.",
        "textFieldMaxLengthError": "Мінімальна довжина 50 літер.",
        "requiredFieldError": "Обов'язкове поле.",
        "messageMaxLengthError": "Максимальна довжина 4000 літер.",
        "wrongEmailError": "Введіть дійсний email.",
        "wrongPhoneNumberError": "Введіть дійсний номер телефону.",
        "phoneLengthError": "Довжина значення становить 12 цифр.",
        "emailSentSuccess": "Повідомлення надіслано",
        "emailSentError": "Помилка на сервері. Будь ласка спробуйте пізніше",
        "eden2012WebsiteBusinessCard": "Eden 2012 (сайт-візитка)",
        "eden2012WebsiteBusinessCardDescription": "Звичайний сайт-візитка для фермерського господарства Eden 2012 із описом бізнесу та контактною інформацією. Можете перейти на веб сайт",
        "eden2012Management": "Eden 2012 - менеджмент",
        "eden2012ManagementDescription": "Система менеджменту полями для фермерського господарства, яка дає змогу зберігати історію обробки землі. Керування доступом користувачів, перегляд статистики прибутку та урожаю, можливість відтворити сезон та завантажити звіт у форматі pdf.",
        "justMusic": "Just music",
        "justMusicDescription": "Простий та безкоштовний аудіоплеєр без реклами для прослуховування музики з мобільного пристрою. Якщо ви не хочете слухати деякі аудіофайли, наприклад файли диктофона, вам слід скористатися функцією ігнорування. Ви можете відкрити сторінку налаштувань, щоб вибрати тему, мову та швидкість відтворення.",
        "mobileServiceTitle": "Розробка мобільних застосунків",
        "mobileServiceDescription": "Вам потрібен мобільний застосунок? Для розробки програм під смартфони ми використовуємо React Native технологію та бібліотеку React Native Paper. Ці інструменти дають можливість реалізовувати мобільні застосунки із сучасним дизайном та швидким функціоналом."
    },
    "en": {
        "homeLink": "HOME",
        "servicesLink": "SERVICES",
        "aboutLink": "ABOUT",
        "contactsLink": "CONTACTS",
        "projectsLink": "PROJECTS",
        "presentationText": "Software development",
        "servicesTitle": "SERVICES",
        "frontEndServiceTitle": "User interface development",
        "frontEndServiceInfo1": "Do you want to have a modern, high-quality and convenient interface? We use modern frameworks such as Angular and ReactJs for frontend development.",
        "frontEndServiceInfo2": "Do you need a website and don't have a lot of time to develop it? Modular development of the user interface using the Angular material library will help to implement the product quickly.",
        "frontEndServiceInfo3": "If you want to have a small business card site, the listed technologies will be enough to meet your needs.",
        "backEndServiceTitle": "Backend Development",
        "backEndServiceInfo1": "If you need a large site with business logic, for example an online store. We use the modern ASP.NET WEB API or ASP.NET MVC framework for backend development",
        "backEndServiceInfo2": "Business logic, allows you to add new data, delete and update it, which will give more possibilities for your web application.",
        "backEndServiceInfo3": "If you need to register new users and work with authorized people, then the server part is indispensable.",       
        "databaseServiceTitle": "Database development",
        "databaseServiceInfo1": "Do you need to store data used by the logic of your web application? For this we can develop a database using MSSQL Server or PostgreSQL technologies",
        "databaseServiceInfo2": "Typically, the business logic of a large web application uses a database to process information. Therefore, you should pay attention to this service.",
        "databaseServiceInfo3": "",
        "aboutTitle":"ABOUT",
        "about1":"The company was registered in the specialty 'Computer programming' in 2020 year. We have been engaged in custom software development since the beginning of our existence.",
        "about2":"The development of web applications from the simplest to the most complex in scale and business logic is the main specialization of the company. The development of the server part for a website for dermatology was one of the first such projects, using ASP.NET Core 3 WEB API technologies, Dapper and MSSQL Server. The microservices architecture helped make this project modular and easy to modify in the future.",
        "about3":"The second project was for an American company that was involved in food storage and delivery. A very large project, where work was not only on the server side, but also on the client side (browser). We used ASP.NET MVC 5, ASP .NET WEB API, Angular 5, Angular Material, Dapper and onion architecture. Besides, we used Selenium and Atata frameworks to support autotests.",
        "about4":"The topic of the next project was logistics for clothes from warehouses to stores. This web application helps to increase the efficiency of the sale of goods. A very interesting project with modern technologies, the versions of which were constantly updated. We used for development Angular, Angular Material, ASP.NET WEB API Core, ADO.NET, MSSQL Server, Entity Framework, SignalR and Azure Services.",
        "aboutCEO":"Parasochka Mykola Gennadiyovych is the director of the company. He began studying at the Kharkiv Polytechnic Institute majoring in Computer Engineering in 2016. Received a bachelor's degree in 2020, and received a master's degree on December 23, 2021. He has been working in the field of computer programming since 2019 as a .Net full-stack developer.",
        "contactsTitle":"CONTACTS",
        "CEO":"Director: ",
        "CEOName": "Parasochka Mykola Gennadiyovych",
        "CEOMobilePhoneNumber":"Mobile phone: +380991191389",
        "firstName": "Name",
        "lastName": "Last name",
        "email": "Email",
        "phoneNumber":"Phone number",
        "messageTitle": "Message",
        "sendLabel": "Send",
        "onlyLetttersError": "This field can have only letters.",
        "textFieldMinLengthError": "The minimum length is 2 letters.",
        "textFieldMaxLengthError": "The minimum length is 50 letters.",
        "requiredFieldError": "Required field.",
        "messageMaxLengthError": "The maximum length is 4000 letters.",
        "wrongEmailError": "Enter a valid email",
        "wrongPhoneNumberError": "Enter a valid phone number.",
        "phoneLengthError": "The length of the value is 12 digits.",
        "emailSentSuccess": "Message was sent",
        "emailSentError": "There is server error. Please try later.",
        "eden2012WebsiteBusinessCard": "Eden 2012 (business card website)",
        "link": "link",
        "eden2012WebsiteBusinessCardDescription": "The original business card website for the farming business of Eden 2012 with a description and contact information. You can go to the website",
        "eden2012Management": "Eden 2012 - management",
        "eden2012ManagementDescription": "A field management system for the farming kingdom, which allows you to find out the history of land cultivation. Access to sources, viewing profit and harvest statistics, the ability to open the season and download in pdf format.",
        "justMusic": "Just music",
        "justMusicDescription": "Simple and free ad-free audio player for listening to music from your mobile device. If you don't want to listen to some audio files, such as voice recorder files, you should use the ignore function. You can open the settings page to select the theme, language and playback speed.",
        "mobileServiceTitle": "Mobile applications development",
        "mobileServiceDescription": "Do you need a mobile app? We use React Native technology and the React Native Paper library to develop apps for smartphones. These tools make it possible to implement mobile applications with modern design and fast functionality."
    }
}